app/controllers/games_controller.rb

  def create
    game = Game.new
    if game.save!
---
INSERT INTO "games" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2024-04-08 14:17:58.050515"], ["updated_at", "2024-04-08 14:17:58.050515"]]

  def show
    game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def status
    game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def score
    game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def close
    game = Game.find_by(id: params[:id])

    if game
      game.update(status: 'closed')
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "games" SET "status" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["status", "closed"], ["updated_at", "2024-04-08 15:54:20.645831"], ["id", 7]]