app/controllers/rolls_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "rolls" ("game_id", "pins_knocked_down", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["game_id", 10], ["pins_knocked_down", 7], ["created_at", "2024-04-08 14:30:10.368164"], ["updated_at", "2024-04-08 14:30:10.368164"]]
---
  def create
    game = Game.find(params[:game_id])
    roll = game.rolls.new(pins_knocked_down: params[:pins_knocked_down])

    if roll.save