app/models/roll.rb

UPDATE "games" SET "status" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["status", "running"], ["updated_at", "2024-04-08 14:30:10.374128"], ["id", 10]]
---
  def update_total_score
    total_score = game.calculate_score.sum(&:values).sum
    game.update!(total_score: total_score)