app/models/roll.rb

  def update_game_status
    rolls_count = game.rolls.count
---
SELECT COUNT(*) FROM "rolls" WHERE "rolls"."game_id" = $1  [["game_id", 10]]